rm(list = ls())

# ------------------------------------------------------------------------------
# Se carga el script que calcula el tamaño y demás insumos
# ------------------------------------------------------------------------------

source("rutinas/02_tamanio/01_tamanio.R")

# ------------------------------------------------------------------------------
# Usamos la función definida en los scripts
# ------------------------------------------------------------------------------

domtotal_09 <- tam_eut_2025(m =  9, tnr = 0.20, delta = 0.055)

# ------------------------------------------------------------------------------
# Exportamos el resultado.
# ------------------------------------------------------------------------------

export(domtotal_09 %>% select(dom, dominio, n_upm_muestra, n_viv_muestra), 
       "resultado_DOMTOTAL_todo_0055PORC_002.xlsx")
